#+title: Lab1
#+PROPERTY: header-args :results pp
#+STARTUP: inlineimages

Welcome to Lab1 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*

The goal is to set up a fully functional Drupal site using a Kubernetes cluster on your computer. Ideally using Linux.
With a local Kubernetes cluster you will be able to test and develop, mimicking a production cluster.

This guide assumes you have Docker installed on your Linux system.
If not, please install it first from https://docs.docker.com/engine/install/ or using your distribution packages.
Each major action is broken down into steps, with each step containing the necessary commands and explanations.

** Step 1: Install k3d
   :PROPERTIES:
   :CUSTOM_ID: install-k3d
   :END:

   There are several tools that facilitate creating a local Kubernetes cluster, like k3d, kind or minikube.
   In Lab 1 we use k3d, while in Lab 2, we go over the other two.

   1. Download and install the latest version of k3d.
      #+BEGIN_SRC bash
      wget -q -O - https://raw.githubusercontent.com/rancher/k3d/main/install.sh | bash
      #+END_SRC
   2. Verify the installation.
      #+BEGIN_SRC shell
      k3d version
      #+END_SRC

      #+RESULTS:
      : k3d version v5.8.3
      : k3s version v1.31.5-k3s1 (default)

** Step 3: Install Helm
   :PROPERTIES:
   :CUSTOM_ID: install-helm
   :END:
   1. Download and install Helm.
      #+BEGIN_SRC bash
      curl https://raw.githubusercontent.com/helm/helm/master/scripts/get-helm-3 | bash
      #+END_SRC
   2. Verify Helm installation.
      #+BEGIN_SRC bash
      helm version
      #+END_SRC

      #+RESULTS:
      : version.BuildInfo{Version:"v3.17.2", GitCommit:"cc0bbbd6d6276b83880042c1ecb34087e84d41eb", GitTreeState:"clean", GoVersion:"go1.23.7"}


** Step 4: Add Bitnami Helm Chart Repository
   :PROPERTIES:
   :CUSTOM_ID: add-bitnami-repo
   :END:

   For our installation we will use helm charts from an opensource repository.
   Helm charts are yaml files that declare/define what the application will need to run.

   1. Add the Bitnami repository.
      #+BEGIN_SRC bash
      helm repo add bitnami https://charts.bitnami.com/bitnami
      #+END_SRC

      #+RESULTS:
      : "bitnami" already exists with the same configuration, skipping


   2. Update Helm repository.
      #+BEGIN_SRC bash
      helm repo update
      #+END_SRC

      #+RESULTS:
      : Hang tight while we grab the latest from your chart repositories...
      : ...Successfully got an update from the "nfs-subdir-external-provisioner" chart repository
      : ...Successfully got an update from the "longhorn" chart repository
      : ...Successfully got an update from the "bitnami" chart repository
      : Update Complete. ⎈Happy Helming!⎈


      NOTE: repositories are cached locally at $HOME/.cache/helm/ and configs in $HOME/.config/helm/. Check 'helm env'

*** Deploy Drupal using helm charts

   We are deploying Drupal using the =values.yaml= provided.
   This works around a problem which I provided a fix for in:
   https://github.com/bitnami/containers/pull/73235

   1. Deploy Drupal and MariaDB. This will use https://github.com/bitnami/charts/tree/main/bitnami/drupal
      #+BEGIN_SRC bash
      helm install my-drupal bitnami/drupal -f values.yaml
      #+END_SRC

   2. Monitor pod status.
      #+BEGIN_SRC bash
      kubectl get pods
      #+END_SRC

   4. List pods and deployments
      #+begin_src bash
      kubectl top pod --sort-by=cpu -A
      kubectl get deployments -A
      #+end_src

      #+RESULTS:
      #+begin_example
      NAMESPACE     NAME                                      CPU(cores)   MEMORY(bytes)
      default       my-drupal-mariadb-0                       16m          196Mi
      kube-system   metrics-server-5985cbc9d7-r27c5           3m           21Mi
      default       my-drupal-6874d67b74-lshhg                2m           84Mi
      kube-system   coredns-ccb96694c-gdzgb                   2m           14Mi
      kube-system   local-path-provisioner-5cf85fd84d-cs48s   1m           8Mi
      kube-system   traefik-5d45fc8cc9-l8xsc                  1m           29Mi
      kube-system   svclb-traefik-5b7ec9c6-rh7bx              0m           0Mi
      kube-system   svclb-traefik-5b7ec9c6-vql9c              0m           0Mi
      kube-system   svclb-traefik-5b7ec9c6-zmrl7              0m           0Mi
      NAMESPACE     NAME                     READY   UP-TO-DATE   AVAILABLE   AGE
      default       my-drupal                1/1     1            1           7m13s
      kube-system   coredns                  1/1     1            1           45m
      kube-system   local-path-provisioner   1/1     1            1           45m
      kube-system   metrics-server           1/1     1            1           45m
      kube-system   traefik                  1/1     1            1           45m
      #+end_example

   5. List all Helms
      #+begin_src bash
      helm list -A
      #+end_src

   6. Where is my data stored?
      #+begin_src bash
      kubectl get pvc -A
      #+end_src

   7. What is going on?
      Follow the logs of your deployment:
      #+BEGIN_SRC bash
      kubectl logs -f deployments/my-drupal
      #+END_SRC

** Step 6: Access Your Drupal Site
   :PROPERTIES:
   :CUSTOM_ID: access-drupal
   :END:

   1. Get your Drupal login credentials by running:
      #+BEGIN_SRC bash
      echo Username: user
      echo Password: $(kubectl get secret --namespace default my-drupal -o jsonpath="{.data.drupal-password}" | base64 -d)
      #+END_SRC

      #+RESULTS:
      : Username: user
      : Password: pn7GyPbfqh

2. Expose a port to connect to the Drupal deployment
Only use one of the options below

    - OPTION 1: Use an ingress
	#+begin_src bash
		kubectl create ingress my-drupal --rule="/*=my-drupal:80"
	#+end_src

	- OPTION 2: Forward port 80 to the my-drupal service

	Identify the Drupal service name:
	#+begin_src bash
	  kubectl get services
	#+end_src
	You should see a service named my-drupal.
	Forward port 80 on your local machine to the service's port:
	#+begin_src bash
	  kubectl port-forward svc/my-drupal 80:80
	#+end_src

    - OPTION 3: If that didn't work, alternately you can forward port 80 to the Drupal pod.
    #+BEGIN_SRC bash
    DPOD=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=drupal" -o jsonpath="{.items[0].metadata.name}")
    kubectl port-forward --namespace default --address 127.0.0.1 $DPOD 80:80
    #+END_SRC

    3. Access the Drupal site at http://localhost.

** Step 7: Monitoring Drupal
:PROPERTIES:
:CUSTOM_ID: monitoring-drupal
:END:
1.  Deploy Metrics Server to gather CPU and memory usage (not needed in k3d):
    #+begin_src bash
    # kubectl apply -f https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
    #+end_src
2.  View the resource utilization of the Drupal pods:
    #+begin_src bash
    kubectl top pod
    #+end_src

    #+RESULTS:
    : NAME                         CPU(cores)   MEMORY(bytes)
    : my-drupal-6874d67b74-lshhg   2m           122Mi
    : my-drupal-mariadb-0          17m          206Mi

3.  View Drupal logs:
    #+begin_src bash
    kubectl logs $(kubectl get pods -l app.kubernetes.io/name=drupal -o jsonpath='{.items[0].metadata.name}')
    #+end_src

** Ensure Pods are Running and Ready
   #+BEGIN_SRC bash
   kubectl get pods
   #+END_SRC

   #+RESULTS:
   :results:
   NAME                         READY   STATUS    RESTARTS   AGE
   my-drupal-84766b946f-m4pcd   1/1     Running   0          37m
   my-drupal-mariadb-0          1/1     Running   0          37m
   :end:

